The files krk-airlines.csv, krk-flights.csv and krk-passengers.csv contain data about flights from Krakow Airport. In a separate notebook, calculate and display:

In [34]:
import pandas as pd

airlines = pd.read_csv("krk-airlines.csv")
flights = pd.read_csv("krk-flights.csv")
passengers = pd.read_csv("krk-passengers.csv")

* list including flight number and destination (two columns)

In [35]:
flights.loc[:, ["flight", "to"]]

  flight        to
0  LN222    London
1  BE321    Berlin
2  PA006     Paris
3  NY777  New York

* flight list with the full name of the airline and the name of the aircraft

In [36]:
pd.merge(flights, airlines, on="airlineid")

  flight    from        to airlineid     airline     airplane
0  LN222  Krakow    London        PE   PanEurope   Boeing 787
1  BE321  Krakow    Berlin        SH  SunHoliday  Airbus A319
2  PA006  Krakow     Paris        SH  SunHoliday  Airbus A319
3  NY777  Krakow  New York        BS     BlueSky  Airbus A330

* a list of passengers on a flight to London sorted by surname

In [37]:
pd.merge(passengers, flights, on="flight").query("to == 'London'").loc[
    :, ["name", "surname"]
].sort_values("surname")

        name     surname
99   Claudie       Braid
9   Nehemiah     Budcock
98    Ingmar     Cockman
35    Willyt     Matlock
61    Rennie  McComiskey
4   Ferguson       Osban
41    Nolana      Pattie
70    Mareah      Peplay
56    Araldo     Permain
62    Stormy       Quare
73      Edik     Smieton
16     Lindi       Snoad
97  Emmanuel      Tickel
85    Ashton    Tregunna
77  Brewster        Vear

* a list of women flying to Paris ordered by surname

In [38]:
pd.merge(passengers, flights, on="flight").query(
    "gender == 'Female' and to == 'Paris'"
).loc[:, ["name", "surname"]].sort_values("surname")

         name     surname
15    Miguela      Benzie
3       Heath  Butterfill
69    Erminie     Earland
91     Janene       Elger
44      Alene        Emig
25    Chelsae       Evins
46      Fanny    Fennessy
84      Paige   Freeborne
89    Genevra    Garlicke
66      Linda      Kupper
21  Annemarie      Letson
79        Lia     Mapston
1       Korry     McGrann
42     Ivette     Milesap
36      Leann   Pinkerton
22       Cloe    Salzberg
90     Prisca   Scutching
32        Kip     Sumpton
51     Blanch        Tink
55      Talia      Yendle

* number of passengers on the flight to Berlin

In [39]:
pd.merge(passengers, flights, on="flight").query("to == 'Berlin'").shape[0]

17

* number of men flying from Krakow

In [40]:
pd.merge(passengers, flights, on="flight").rename(columns={"from": "departure"}).query(
    "gender == 'Male' and departure == 'Krakow'"
).shape[0]

54

* number of passengers for each flight

In [41]:
passengers.loc[:, ["flight", "surname"]].groupby("flight").count().rename(
    columns={"surname": "number"}
)

        number
flight
BE321       17
LN222       15
NY777       27
PA006       41